## Proxmox Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_vm_qemu.vm["boot-server.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node01/qemu/105"
        name                   = "boot-server"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["dns.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node01/qemu/100"
        name                   = "dns.fullstack.pw"
        tags                   = null
        # (44 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["haproxy.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node01/qemu/101"
        name                   = "haproxy.fullstack.pw"
        tags                   = null
        # (44 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k01.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node03/qemu/102"
        name                   = "k01.fullstack.pw"
        tags                   = null
        # (44 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k02.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node03/qemu/103"
        name                   = "k02.fullstack.pw"
        tags                   = null
        # (44 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k03.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node03/qemu/104"
        name                   = "k03.fullstack.pw"
        tags                   = null
        # (44 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-dev.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node03/qemu/106"
        name                   = "k8s-dev"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-home.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = false
      + ciuser                 = "suporte"
      + clone                  = "ubuntu24-cloudinit"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.16/24,gw=192.168.1.1,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "k8s-home"
      + nameserver             = "192.168.1.3"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 2
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9"
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "node02"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + disks {
          + ide {
              + ide1 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "100G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["k8s-prod.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node01/qemu/107"
        name                   = "k8s-prod"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-stg.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node01/qemu/108"
        name                   = "k8s-stg"
        tags                   = null
        # (52 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-tools.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + agent_timeout          = 90
        id                     = "node03/qemu/109"
      ~ memory                 = 16384 -> 8192
        name                   = "k8s-tools"
      ~ sockets                = 2 -> 1
        tags                   = null
        # (50 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 10 to change, 0 to destroy.

Changes to Outputs:
  ~ k8s_nodes         = {
      ~ "k01.yaml"       = {
          ~ node = "node01" -> "node03"
            # (1 unchanged attribute hidden)
        }
      ~ "k02.yaml"       = {
          ~ node = "node01" -> "node03"
            # (1 unchanged attribute hidden)
        }
      ~ "k03.yaml"       = {
          ~ node = "node01" -> "node03"
            # (1 unchanged attribute hidden)
        }
      ~ "k8s-dev.yaml"   = {
          ~ node = "node02" -> "node03"
            # (1 unchanged attribute hidden)
        }
      + "k8s-home.yaml"  = {
          + ip   = "ip=192.168.1.16/24,gw=192.168.1.1,ip6=dhcp"
          + node = "node02"
        }
      ~ "k8s-prod.yaml"  = {
          ~ node = "node02" -> "node01"
            # (1 unchanged attribute hidden)
        }
      ~ "k8s-stg.yaml"   = {
          ~ node = "node02" -> "node01"
            # (1 unchanged attribute hidden)
        }
      ~ "k8s-tools.yaml" = {
          ~ node = "node01" -> "node03"
            # (1 unchanged attribute hidden)
        }
    }
  ~ vm_ips            = {
      + "k8s-home.yaml"    = "ip=192.168.1.16/24,gw=192.168.1.1,ip6=dhcp"
        # (10 unchanged attributes hidden)
    }

  ```
  
  Plan exit code: 0
  